
//  Double Equal vs Triple Equal

/**** JavaScript এর Double Equal (==) এবং Triple Equal (===) অপারেটর দুটি ভিন্ন ধরণের তুলনা করে।

**Double Equal (==):

1. Double Equal অপারেটর ব্যবহার করা হয় মানের মান তুলনা করতে। এটি দুইটি মানের টাইপগুলি সমাধান করে এবং তাদের মানগুলি সমান হলে true রিটার্ন করে।

2. যদি দুইটি মানের টাইপ পূর্ণরূপে সমান না হয়, তবে JavaScript কনভার্ট করে তাদের মান সমান হতে পারবে কিনা তা পরীক্ষা করে এবং তাদের মানগুলি সমান হলে true রিটার্ন করে। এটি কনভার্ট করার সিদ্ধান্ত গ্রহণ করে যেটি সাধারণত স্ক্রিপ্ট এর পুর্বস্থিতি এর মাধ্যমে নির্ধারণ করা হয়।


*** Triple Equal (===):

1. Triple Equal অপারেটর সমান মান এবং টাইপের সমতা পরীক্ষা করে। দুইটি মানের টাইপ এবং মান সমান হলেই true রিটার্ন করে।
2. যদি দুইটি মানের টাইপ পূর্ণরূপে সমান না হয়, অথবা তাদের মান সমান না হয়, তবে এটি false রিটার্ন করে।

**এটি খেতাবে যে সাধারণভাবে আমরা Triple Equal (===) অপারেটর ব্যবহার করতে পছন্দ করি, কারণ এটি মানের টাইপ এবং মানের সমতা উভয়ই পরীক্ষা করে। এটি মানের টাইপের এক্যুরেট পরীক্ষা করে এবং এটি অপ্টিমাইজড বা অনুমতি প্রদান করে যে না কিছুটা হতে পারে। তবে, সময় সময়ে দ্বিতীয় সমতা পরীক্ষা প্রয়োজন হতে পারে, তাদের মানের টাইপ এবং সামান্য সাধারণ পরীক্ষা করতে।
 */