//  hoistion mahtod

// JavaScript একটি ইন্টারপ্রেটেড ল্যাঙ্গুয়েজ, অর্থাৎ এটি কোড রান করার সময় স্টেপ বাই স্টেপ প্রসেস করে। হোইস্টিং (Hoisting) হলো JavaScript ইঞ্জিনের একটি বৈশিষ্ট্য যা বর্বরতা ও বোঝার কঠিন কাজগুলি মনে করে আগে উল্লেখ করে।

// হোইস্টিংের মূল ধারণা হলো সমস্ত ভেরিয়েবল ডিক্লেয়ারেশনগুলি এবং ফাংশন ডিক্লেয়ারেশনগুলি রানটাইমের আগে উল্লেখ করা হয়। এটি বোঝা যায় যে, কোডের সুবিধার জন্য ডিক্লেয়ার করা নিয়ে প্রথমে এগুলির ভ্যালু সেট করা হয় না।

// এটি নির্দিষ্ট ভেরিয়েবল বা ফাংশনের ডিক্লেয়ারেশন এবং আপনি তাদের ব্যবহারের আগে উল্লেখ না করেও ডিক্লেয়ার করতে দেয় সম্পূর্ণ। হোইস্টিং শুধুমাত্র ডিক্লেয়ারেশনগুলি উল্লেখ করে, তারা যে লাইনে বা কোডে ব্যবহার হচ্ছে তার পরে উল্লেখ না করা হয়।

// এটির একটি উদাহরণ দেখা যাক:

console.log(x); // Output: undefined
var x = 5;


// উপরের উদাহরণে, var x = 5; এটি প্রথমে ডিক্লেয়ার হয় তবে আরেকটি স্কোপে না থাকা সত্ত্বেও কোডের শুরুতে উল্লেখ না করে কোন ভ্যারিয়েবল অথবা ফাংশনের ডিক্লেয়ারেশন উল্লেখ করা হয়েছে এবং এটি ডিফল্টভাবে undefined হিসাবে সেট হয়।

// হোইস্টিংের এই বৈশিষ্ট্যটি বুঝতে গুরুত্বপূর্ণ কিছু বিষয় রয়েছে:

// 1. হোইস্টিং শুধুমাত্র var কীওয়ার্ড ব্যবহার করে ভেরিয়েবল ডিক্লেয়ার করার সময় প্রযোজ্য। let এবং const কীওয়ার্ড ব্যবহার করে তৈরি ভেরিয়েবল এবং তাদের উল্লেখ না করে ব্যবহারের পরিস্থিতি হোইস্টিং নেই।

// 2. ফাংশন ডিক্লেয়ারেশনগুলি ওয়ার্ড ছাড়াই হোইস্ট হয়। এটি মানে যে ফাংশন ডিক্লেয়ারেশনগুলি ব্লকের শুরুতে ডিফল্টভাবে উল্লেখ হয়।

