//  null vs Undifine

// JavaScript এর null এবং undefined দুটি ভিন্ন ধরনের মূল মৌলিক ডেটা টাইপ। এই দুটি মানের মধ্যে পার্থক্য আছে:

/***
 * 1. undefined: যখন একটি ভেরিয়েবল ডিফাইন করা না হয় বা একটি ফাংশন কোনো রিটার্ন মান না দেয় তখন ঐ ভেরিয়েবলের মান undefined হয়। এটি ডিফল্ট মান।
উদাহরণ:
        let x;
        console.log(x); // Output: undefined

 * 2.  null: যখন কোনো ভেরিয়েবলের মান অজানা রাখা হয়, অর্থাৎ সেটি কোনো মান অথবা রেফারেন্স না থাকলে, তখন সেই ভেরিয়েবলের মান null হয়।

উদাহরণ:
        let y = null;
        console.log(y); // Output: null

** সুতরাং, undefined এবং null দুটি পৃথক মান, তারা প্রায় সব সময় আরও গভীরভাবে ব্যবহৃত হয় এমন অবজেক্ট বা ভেরিয়েবলের মান সেট করার জন্য, যা যোগাযোগের প্রথম পদক্ষেপ হিসাবে null নির্দিষ্ট করে এবং যেখানে কোন মান সেট না করা হয় সেখানে ডিফল্টভাবে undefined থাকে।
 ***/ 