/***
 * JavaScript এ Truthy (সত্যধর্মী) এবং Falsy (মিথ্যা) মান হলো সকল মানের একটি স্ট্যাটাস যা শর্ত অনুযায়ী ব্যবহৃত হয়। যেকোনো মান যদি Truthy হয়, তবে সেটি সত্য হিসেবে গণ্য হবে, এবং যদি Falsy হয়, তবে সেটি মিথ্যা হিসেবে গণ্য হবে। 
 
 * সাধারণভাবে, JavaScript এর নিম্নলিখিত মানগুলি Truthy হিসেবে গণ্য হয়:
1. সত্য মান (true)
2. সংখ্যা মূল্য (যেমন, 1, 2, 3, ইত্যাদি)
3. অক্ষরের মৌলিক একক (যেমন, "hello", "abc", ইত্যাদি) 
4. ফাংশন


* সাধারণভাবে, নিম্নলিখিত মানগুলি Falsy হিসেবে গণ্য হয়:
1. মিথ্যা মান (false)
2. শূন্য (0)
3. খালি স্ট্রিং ("" বা '')
4. NaN (Not a Number)
5 null
6. undefined

**এই Truthy এবং Falsy মানগুলি অনেকটা প্রোগ্রামিং প্রায়শই ব্যবহৃত হয় যা শর্ত পরীক্ষা করতে এবং নির্দিষ্ট মৌলিক অথবা অমৌলিক মান সেট করতে ব্যবহৃত হয়। এই মানগুলি লজিকাল অপারেটর (যেমন, if বা টার্নারি অপারেটর) ব্যবহার করে নির্দিষ্ট অপারেশন পরীক্ষা করতে এবং নির্দিষ্ট কোড ব্লক বা মান রিটার্ন করতে ব্যবহৃত হয়।
 */ 
